Tekla Open API Reference for Tekla Structures 2025
UserDefinedElement Constructor (String, FontAttributes)
 Creates a new user-defined element instance with the given name and font.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public UserDefinedElement(
	string Name,
	FontAttributes Font
)
Public Sub New (
	Name As String,
	Font As FontAttributes
)
Parameters
Name
Type: System.String
The name to be used.
Font
Type: Tekla.Structures.Drawing.FontAttributes
The font to be used.
See Also
Reference
UserDefinedElement Class
UserDefinedElement Overload
Tekla.Structures.Drawing Namespace